//
//  attentiveCaption.swift
//  attentive_caption_0125
//
//  Created by 登山元気 on 2018/01/25.
//  Copyright © 2018年 genki toyama. All rights reserved.
//

import Foundation

class attentiveCaption {
    static let title:String = "attentive caption"
    
    static let authors:[String] = ["Genki Toyama", "Yui Toshiya", "Erika Kina"]
    
    static let abst:String = "鑑賞者に合わせて\n説明文を変える\n気配り上手な\nキャプション"
    
    static let detail:String = "　本作品は、鑑賞者の外見の様子や作品への興味に合わせて、自動で説明文の量や文体を変えてくれるキャプションです。それぞれの鑑賞者に対して、機械がその人に与えるべき適切な情報量を判断し表示することで、鑑賞者は違和感なく自身に合った距離感で作品に接することができます。そんな「気配り上手なキャプション」によって、鑑賞者とキャプションとの新しいあり方を提案します。"
    
    static let moreDetail:String = "　キャプションは作品に関する情報を詳しく知らせるために用いられています。そのキャプションに対して求める情報のあり方は鑑賞者によって異なります。じっくり詳しく知りたい人やわかりやすく伝えて欲しい人、周りに待っている人がいるためすぐに読みたい人など、その人の性質や周りの環境によって多種多様な情報の形が求められます。それに対して、キャプションはどの鑑賞者に対してもあらかじめ決められた形のまま固定されています。そのため、鑑賞者がキャプションに求める情報量と、実際のキャプションの情報量との間にズレが生じてしまうことは少なくありません。\n そこで私たちは、鑑賞者の外見や作品への興味度に合わせ自動で説明文の量や文体を変えてくれるキャプションを制作しました。それぞれの鑑賞者に対して機械が適切な情報量を判断し表示することで、鑑賞者は違和感なく自身に合った距離感で作品にも接することができます。そんな「気配り上手なキャプション」によって、鑑賞者とキャプションとの新しいあり方を提案します。"
    
    static let urabanashi:String = "　展覧会で鑑賞している人を観察していると、作品を見る時間がキャプションを見る時間よりも短かったりして、傍目から見ると鑑賞者と作品・キャプションのそれぞれの関係がアンバランスに思えていました。\n　このキャプションによって、鑑賞者と作品とキャプションの3者が良いバランスに釣り合ってくれる。そんな体験を提供できたら嬉しいです。"
    
    static let hitaAbst:String = "かんしょう者に合わせて\nせつ明文をかえる\n気配り上手な\nキャプション"
    
    static let hiraDetail:String = "　本作品は、鑑賞者の外見の様子や作品への興味に合わせて、自動で説明文の量や文体を変えてくれるキャプションです。それぞれの鑑賞者に対して、機械がその人に与えるべき適切な情報量を判断し表示することで、鑑賞者は違和感なく自身に合った距離感で作品に接することができます。そんな「気配り上手なキャプション」によって、鑑賞者とキャプションとの新しいあり方を提案します。"
    
    static let hiraMoreDetail:String = "　キャプションは作品に関する情報を詳しく知らせるために用いられています。そのキャプションに対して求める情報のあり方は鑑賞者によって異なります。じっくり詳しく知りたい人やわかりやすく伝えて欲しい人、周りに待っている人がいるためすぐに読みたい人など、その人の性質や周りの環境によって多種多様な情報の形が求められます。それに対して、キャプションはどの鑑賞者に対してもあらかじめ決められた形のまま固定されています。そのため、鑑賞者がキャプションに求める情報量と、実際のキャプションの情報量との間にズレが生じてしまうことは少なくありません。\n そこで私たちは、鑑賞者の外見や作品への興味度に合わせ自動で説明文の量や文体を変えてくれるキャプションを制作しました。それぞれの鑑賞者に対して機械が適切な情報量を判断し表示することで、鑑賞者は違和感なく自身に合った距離感で作品にも接することができます。そんな「気配り上手なキャプション」によって、鑑賞者とキャプションとの新しいあり方を提案します。"
    
    static let hiraUrabanashi:String = "　展覧会で鑑賞している人を観察していると、作品を見る時間がキャプションを見る時間よりも短かったりして、傍目から見ると鑑賞者と作品・キャプションのそれぞれの関係がアンバランスに思えていました。\n　このキャプションによって、鑑賞者と作品とキャプションの3者が良いバランスに釣り合ってくれる。そんな体験を提供できたら嬉しいです。"
}
